import Player from "../../../player/classPlayer.js";
import promptSync from "prompt-sync";
const prompt = promptSync();

const actions = [{
    name:"EnterLayrinth",
    information:"Ви підходите до древнього входу в Лабіринт Часу, який розташований серед глибоких лісових дерев. \n" +
    "На стінах входу викарбувані стародавні символи, які починають світитися, як тільки він наближається. \n" +
    "Ви відчуваєте, як час навколо нього змінюється – дерева здаються старшими, а листя, яке тільки що було зеленим, тепер поволі в'яне. \n" +
    "Ви розумієте, що він вже увійшов у межі лабіринту і тепер час діє інакше.\n"+
    "\nВи стоїте перед трьома шляхами, кожен з яких позначений древніми символами: 'Сонце', 'Місяць', і 'Зорі'.",
    hint:"Вибери шлях, що символізує початок і кінець одного дня.",
    action(player){
        console.log("#-----------------#")
        console.log(this.information)
        console.log(this.hint)
        console.log("Enter number:\n"+
            "(1) - Сонце\n"+
            "(2) - Місяць\n"+
            "(3) - Зорі\n"
        )
        const choice = +prompt("Enter number: ");
        console.clear()
        switch(choice){
            case 1:
                console.log("Ви вибрали правильний напрямок")
                break;
            case 2 || 3:
                console.log("Час починає прискорюватися, і ви починаєте швидко старіти, змушуючи вас повернутися до початку лабіринту.(Ви постарішали на 5 років)")
                player.age += 5;
                this.action(player)
                break;
            default:
                console.log("Введіть правильний варіант!")
                this.action(player);
                break;
        }
        return player
    }
},{
    name:"Загублені Спогади",
    information:"Ви проходите коридором, на стінах якого з'являються образи з вашого минулого.\n"+
    "Він бачить три сцени зі свого життя:\n"+
    "(1) - Його перша зустріч з лісом і любов до природи.\n"+
    "(2) - Момент, коли він втратив важливу людину.\n"+
    "(3) - Успішне завершення складної місії в минулому.",
    hint:"Виберіть дві найважливіші події, які формують ваш характер і вплинули на нинішню подорож.(І запишіть її через пробіл, наприклад: '34 32')",
    action(player){
        console.log("#-----------------#")
        console.log(this.information);
        console.log(this.hint);
        const choice = prompt("Enter value: ");
        console.clear();
        const answer = choice.split(" ");
        switch(answer){
            case (+answer[0]===1 && +answer[1]===3):
                console.log("Ви правильно відповіли!");
                break;
            default:
                console.log("Ви застряли в цьому лабіринті навіки!")
                return "Lose";
        }
        return player;
    }
},{
    name:"Відновлення Розірваного Кола",
    information:"Герой потрапляє в круглу кімнату з древніми символами на підлозі, які утворюють коло. \n"+
    "В центрі кола знаходиться кришталева куля, що спочатку тьмяно світиться. Коли герой наближається, він помічає, що деякі символи зруйновані, \n"+
    "і кристал поступово втрачає своє світіння.\n"+
    "Герой повинен відновити цілісність кола, повернувши правильні символи на їхні місця. \n"+
    "У кімнаті є декілька плиток з різними символами, але тільки три з них підходять до порушених ділянок. \n"+
    "Герой повинен розпізнати, які символи відновлюють баланс у колі.",
    action(player){
        console.log("#-----------------#")
        console.log(this.information);
        console.log("Ви бачите перед собою декілька плиток: одні з символами природи ((1)-дерево,(2)-листя,(3)-сонце,(4)-вода,(5)-вогонь,(6)-облако), інші – з абстрактними знаками.(Відповідь має бути записана через пробіл)")
        const choice = prompt("Введите ответ:")
        const answer = choice.split(" ")
        console.clear();
        console.log("Ви відновлюєте магічний захист кімнати, і ви відкриваєте вихід з лабіринту!");
        return player;
    }
}]


const actionsForLabyrinth = (player) => {
    actions.forEach((e)=>{
        e.action(player);
    })
    return player;
}

export default actionsForLabyrinth;